# HW4 PRANAV PRAJAPATI

Q1)

In [ ]:
library('tidyverse')
library('dplyr')
baby_names <- read_csv("http://personal.stevens.edu/~fmai/data/Most_Popular_Baby_Names.csv")

In [2]:
dim(baby_names)

[1] 13962     5

In [3]:
baby_names <- baby_names %>% filter(BRTH_YR >= 2012)

In [7]:
baby_names$Name <- tolower(baby_names$Name)

In [8]:
head(baby_names)

  BRTH_YR Gender ETHCTY         Name      Count
1 2012    FEMALE ASIAN AND PACI abby      11
2 2012    FEMALE ASIAN AND PACI abigail   29
3 2012    FEMALE ASIAN AND PACI ada       12
4 2012    FEMALE ASIAN AND PACI aisha     11
5 2012    FEMALE ASIAN AND PACI alexandra 12
6 2012    FEMALE ASIAN AND PACI alexis    18

# a)

In [10]:
summarise(baby_names, Total_observations = n(), UNIQUE_names = n_distinct(Name))

  Total_observations UNIQUE_names
1 6110               1541

# b)

In [13]:
baby_names %>%
group_by(BRTH_YR,ETHCTY) %>%
summarise( Count_of_Babies = sum(Count))

   BRTH_YR ETHCTY                     Count_of_Babies
1  2012    ASIAN AND PACI             10300
2  2012    BLACK NON HISP             10208
3  2012    HISPANIC                   23547
4  2012    WHITE NON HISP             26675
5  2013    ASIAN AND PACIFIC ISLANDER  9293
6  2013    BLACK NON HISPANIC         10144
7  2013    HISPANIC                   23067
8  2013    WHITE NON HISPANIC         26840
9  2014    ASIAN AND PACIFIC ISLANDER  9834
10 2014    BLACK NON HISPANIC          9957
11 2014    HISPANIC                   22855
12 2014    WHITE NON HISPANIC         27715

# c)

In [48]:
baby_names %>%
group_by(BRTH_YR,Name) %>%
summarise( tots = sum(Count)) %>%
arrange(BRTH_YR, desc(tots))  %>%
mutate(rank = rank(desc(tots))) %>%
filter(rank <= 3)

  BRTH_YR Name   tots rank
1 2012    jayden 752  1
2 2012    ethan  723  2
3 2012    jacob  641  3
4 2013    jayden 742  1
5 2013    ethan  688  2
6 2013    jacob  654  3
7 2014    ethan  728  1
8 2014    jacob  669  2
9 2014    liam   625  3